Revit 2027 API
DockablePaneState(DockablePaneState) Constructor
 Constructs a new copy of the input DockablePaneState object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockablePaneState(
	DockablePaneState other
)
Public Sub New (
	other As DockablePaneState
)
public:
DockablePaneState(
	DockablePaneState^ other
)
new :
        other : DockablePaneState -> DockablePaneState
Parameters
other DockablePaneState
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DockablePaneState Class
DockablePaneState Overload
Autodesk.Revit.UI Namespace